Sorry @fmunozmiranda , here is the run again with those debugs enabled.

```
[grgibbs@fedora1 ise-policy]$ tf apply --auto-approve
+ terraform apply --auto-approve
2022-11-24T11:28:47.812+1100 [INFO]  Terraform version: 1.3.2
2022-11-24T11:28:47.812+1100 [DEBUG] using github.com/hashicorp/go-tfe v1.9.0
2022-11-24T11:28:47.812+1100 [DEBUG] using github.com/hashicorp/hcl/v2 v2.14.1
2022-11-24T11:28:47.812+1100 [DEBUG] using github.com/hashicorp/terraform-config-inspect v0.0.0-20210209133302-4fd17a0faac2
2022-11-24T11:28:47.812+1100 [DEBUG] using github.com/hashicorp/terraform-svchost v0.0.0-20200729002733-f050f53b9734
2022-11-24T11:28:47.813+1100 [DEBUG] using github.com/zclconf/go-cty v1.11.0
2022-11-24T11:28:47.813+1100 [INFO]  Go runtime version: go1.19.1
2022-11-24T11:28:47.813+1100 [INFO]  CLI args: []string{"terraform", "apply", "--auto-approve"}
2022-11-24T11:28:47.813+1100 [DEBUG] Attempting to open CLI config file: /home/grgibbs/.terraformrc
2022-11-24T11:28:47.813+1100 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2022-11-24T11:28:47.814+1100 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2022-11-24T11:28:47.814+1100 [DEBUG] ignoring non-existing provider search directory /home/grgibbs/.terraform.d/plugins
2022-11-24T11:28:47.814+1100 [DEBUG] ignoring non-existing provider search directory /home/grgibbs/.local/share/terraform/plugins
2022-11-24T11:28:47.814+1100 [DEBUG] ignoring non-existing provider search directory /home/grgibbs/.local/share/flatpak/exports/share/terraform/plugins
2022-11-24T11:28:47.814+1100 [DEBUG] ignoring non-existing provider search directory /var/lib/flatpak/exports/share/terraform/plugins
2022-11-24T11:28:47.815+1100 [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2022-11-24T11:28:47.815+1100 [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2022-11-24T11:28:47.815+1100 [INFO]  CLI command args: []string{"apply", "--auto-approve"}
2022-11-24T11:28:47.817+1100 [DEBUG] New state was assigned lineage "9768b869-de4a-5af2-81c1-e6d5c4586ffe"
2022-11-24T11:28:47.964+1100 [DEBUG] checking for provisioner in "."
2022-11-24T11:28:47.974+1100 [DEBUG] checking for provisioner in "/usr/bin"
2022-11-24T11:28:47.975+1100 [INFO]  backend/local: starting Apply operation
2022-11-24T11:28:47.976+1100 [DEBUG] created provider logger: level=debug
2022-11-24T11:28:47.976+1100 [INFO]  provider: configuring client automatic mTLS
2022-11-24T11:28:47.997+1100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta args=[.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta]
2022-11-24T11:28:47.998+1100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43161
2022-11-24T11:28:47.998+1100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta
2022-11-24T11:28:48.006+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: configuring server automatic mTLS: timestamp=2022-11-24T11:28:48.005+1100
2022-11-24T11:28:48.030+1100 [DEBUG] provider.terraform-provider-ciscoise_v0.6.11-beta: plugin address: address=/tmp/plugin3953086331 network=unix timestamp=2022-11-24T11:28:48.030+1100
2022-11-24T11:28:48.030+1100 [DEBUG] provider: using plugin: version=5
2022-11-24T11:28:48.162+1100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2022-11-24T11:28:48.168+1100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43161
2022-11-24T11:28:48.168+1100 [DEBUG] provider: plugin exited
2022-11-24T11:28:48.168+1100 [DEBUG] Building and walking validate graph
2022-11-24T11:28:48.168+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_deployment_stage" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.168+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_mm" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.168+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_lim" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.168+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-3
2022-11-24T11:28:48.168+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"]
2022-11-24T11:28:48.168+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-1
2022-11-24T11:28:48.168+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage" references: []
2022-11-24T11:28:48.168+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm" references: [ciscoise_network_device_group.ndg_deployment_stage]
2022-11-24T11:28:48.168+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim" references: [ciscoise_network_device_group.ndg_deployment_stage]
2022-11-24T11:28:48.168+1100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/ciscoise/ciscoise\"].ise31-2" references: []
2022-11-24T11:28:48.169+1100 [DEBUG] Starting graph walk: walkValidate
2022-11-24T11:28:48.169+1100 [DEBUG] created provider logger: level=debug
2022-11-24T11:28:48.169+1100 [INFO]  provider: configuring client automatic mTLS
2022-11-24T11:28:48.177+1100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta args=[.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta]
2022-11-24T11:28:48.177+1100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43168
2022-11-24T11:28:48.177+1100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta
2022-11-24T11:28:48.185+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: configuring server automatic mTLS: timestamp=2022-11-24T11:28:48.185+1100
2022-11-24T11:28:48.209+1100 [DEBUG] provider.terraform-provider-ciscoise_v0.6.11-beta: plugin address: address=/tmp/plugin3398334263 network=unix timestamp=2022-11-24T11:28:48.209+1100
2022-11-24T11:28:48.209+1100 [DEBUG] provider: using plugin: version=5
2022-11-24T11:28:48.394+1100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2022-11-24T11:28:48.400+1100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43168
2022-11-24T11:28:48.400+1100 [DEBUG] provider: plugin exited
2022-11-24T11:28:48.400+1100 [INFO]  backend/local: apply calling Plan
2022-11-24T11:28:48.400+1100 [DEBUG] Building and walking plan graph for NormalMode
2022-11-24T11:28:48.400+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_deployment_stage (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.400+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_mm (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.400+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_lim (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.400+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-3
2022-11-24T11:28:48.400+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"]
2022-11-24T11:28:48.400+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-1
2022-11-24T11:28:48.400+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage (expand)" references: []
2022-11-24T11:28:48.400+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm (expand)" references: [ciscoise_network_device_group.ndg_deployment_stage (expand)]
2022-11-24T11:28:48.400+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim (expand)" references: [ciscoise_network_device_group.ndg_deployment_stage (expand)]
2022-11-24T11:28:48.400+1100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/ciscoise/ciscoise\"].ise31-2" references: []
2022-11-24T11:28:48.401+1100 [DEBUG] Starting graph walk: walkPlan
2022-11-24T11:28:48.401+1100 [DEBUG] created provider logger: level=debug
2022-11-24T11:28:48.401+1100 [INFO]  provider: configuring client automatic mTLS
2022-11-24T11:28:48.409+1100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta args=[.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta]
2022-11-24T11:28:48.409+1100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43176
2022-11-24T11:28:48.409+1100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta
2022-11-24T11:28:48.417+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: configuring server automatic mTLS: timestamp=2022-11-24T11:28:48.416+1100
2022-11-24T11:28:48.442+1100 [DEBUG] provider.terraform-provider-ciscoise_v0.6.11-beta: plugin address: address=/tmp/plugin3050936758 network=unix timestamp=2022-11-24T11:28:48.442+1100
2022-11-24T11:28:48.442+1100 [DEBUG] provider: using plugin: version=5
2022-11-24T11:28:48.632+1100 [DEBUG] Resource instance state not found for node "ciscoise_network_device_group.ndg_deployment_stage", instance ciscoise_network_device_group.ndg_deployment_stage
2022-11-24T11:28:48.632+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage" references: []
2022-11-24T11:28:48.632+1100 [DEBUG] refresh: ciscoise_network_device_group.ndg_deployment_stage: no state, so not refreshing
2022-11-24T11:28:48.637+1100 [DEBUG] Resource instance state not found for node "ciscoise_network_device_group.ndg_mm", instance ciscoise_network_device_group.ndg_mm
2022-11-24T11:28:48.637+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm" references: []
2022-11-24T11:28:48.637+1100 [DEBUG] Resource instance state not found for node "ciscoise_network_device_group.ndg_lim", instance ciscoise_network_device_group.ndg_lim
2022-11-24T11:28:48.638+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim" references: []
2022-11-24T11:28:48.638+1100 [DEBUG] refresh: ciscoise_network_device_group.ndg_mm: no state, so not refreshing
2022-11-24T11:28:48.638+1100 [DEBUG] refresh: ciscoise_network_device_group.ndg_lim: no state, so not refreshing
2022-11-24T11:28:48.641+1100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2022-11-24T11:28:48.648+1100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43176
2022-11-24T11:28:48.648+1100 [DEBUG] provider: plugin exited
2022-11-24T11:28:48.648+1100 [DEBUG] building apply graph to check for errors
2022-11-24T11:28:48.648+1100 [DEBUG] Resource state not found for node "ciscoise_network_device_group.ndg_deployment_stage", instance ciscoise_network_device_group.ndg_deployment_stage
2022-11-24T11:28:48.648+1100 [DEBUG] Resource state not found for node "ciscoise_network_device_group.ndg_mm", instance ciscoise_network_device_group.ndg_mm
2022-11-24T11:28:48.648+1100 [DEBUG] Resource state not found for node "ciscoise_network_device_group.ndg_lim", instance ciscoise_network_device_group.ndg_lim
2022-11-24T11:28:48.649+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_lim" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.649+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_deployment_stage (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.649+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_mm (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.649+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_lim (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.649+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_mm" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.649+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_deployment_stage" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.649+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"]
2022-11-24T11:28:48.649+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-1
2022-11-24T11:28:48.649+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-3
2022-11-24T11:28:48.649+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage" references: []
2022-11-24T11:28:48.649+1100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/ciscoise/ciscoise\"].ise31-2" references: []
2022-11-24T11:28:48.650+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim" references: [ciscoise_network_device_group.ndg_deployment_stage ciscoise_network_device_group.ndg_deployment_stage ciscoise_network_device_group.ndg_deployment_stage (expand)]
2022-11-24T11:28:48.650+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage (expand)" references: []
2022-11-24T11:28:48.650+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm (expand)" references: []
2022-11-24T11:28:48.650+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim (expand)" references: []
2022-11-24T11:28:48.650+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm" references: [ciscoise_network_device_group.ndg_deployment_stage ciscoise_network_device_group.ndg_deployment_stage ciscoise_network_device_group.ndg_deployment_stage (expand)]

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ciscoise_network_device_group.ndg_deployment_stage will be created
  + resource "ciscoise_network_device_group" "ndg_deployment_stage" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + description = "Root Deployment Stage NDG"
          + id          = (known after apply)
          + link        = (known after apply)
          + name        = "Deployment Stage#Deployment Stage"
          + ndgtype     = "Deployment Stage"
        }
    }

  # ciscoise_network_device_group.ndg_lim will be created
  + resource "ciscoise_network_device_group" "ndg_lim" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + description = "Low Impact Mode NDG"
          + id          = (known after apply)
          + link        = (known after apply)
          + name        = "Deployment Stage#Deployment Stage#Low Impact Mode"
          + ndgtype     = (known after apply)
        }
    }

  # ciscoise_network_device_group.ndg_mm will be created
  + resource "ciscoise_network_device_group" "ndg_mm" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + description = "Monitor Mode NDG"
          + id          = (known after apply)
          + link        = (known after apply)
          + name        = "Deployment Stage#Deployment Stage#Monitor Mode"
          + ndgtype     = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
2022-11-24T11:28:48.653+1100 [INFO]  backend/local: apply calling Apply
2022-11-24T11:28:48.653+1100 [DEBUG] Building and walking apply graph for NormalMode plan
2022-11-24T11:28:48.653+1100 [DEBUG] Resource state not found for node "ciscoise_network_device_group.ndg_deployment_stage", instance ciscoise_network_device_group.ndg_deployment_stage
2022-11-24T11:28:48.653+1100 [DEBUG] Resource state not found for node "ciscoise_network_device_group.ndg_mm", instance ciscoise_network_device_group.ndg_mm
2022-11-24T11:28:48.653+1100 [DEBUG] Resource state not found for node "ciscoise_network_device_group.ndg_lim", instance ciscoise_network_device_group.ndg_lim
2022-11-24T11:28:48.653+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_lim" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.653+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_mm (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.653+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_lim (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.653+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_mm" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.653+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_deployment_stage (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.653+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_deployment_stage" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:48.653+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-1
2022-11-24T11:28:48.653+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"]
2022-11-24T11:28:48.653+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-3
2022-11-24T11:28:48.654+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim" references: [ciscoise_network_device_group.ndg_deployment_stage (expand) ciscoise_network_device_group.ndg_deployment_stage ciscoise_network_device_group.ndg_deployment_stage]
2022-11-24T11:28:48.654+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage (expand)" references: []
2022-11-24T11:28:48.654+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage" references: []
2022-11-24T11:28:48.654+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm" references: [ciscoise_network_device_group.ndg_deployment_stage (expand) ciscoise_network_device_group.ndg_deployment_stage ciscoise_network_device_group.ndg_deployment_stage]
2022-11-24T11:28:48.654+1100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/ciscoise/ciscoise\"].ise31-2" references: []
2022-11-24T11:28:48.654+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm (expand)" references: []
2022-11-24T11:28:48.654+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim (expand)" references: []
2022-11-24T11:28:48.655+1100 [DEBUG] Starting graph walk: walkApply
2022-11-24T11:28:48.655+1100 [DEBUG] created provider logger: level=debug
2022-11-24T11:28:48.655+1100 [INFO]  provider: configuring client automatic mTLS
2022-11-24T11:28:48.663+1100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta args=[.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta]
2022-11-24T11:28:48.663+1100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43184
2022-11-24T11:28:48.663+1100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta
2022-11-24T11:28:48.673+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: configuring server automatic mTLS: timestamp=2022-11-24T11:28:48.673+1100
2022-11-24T11:28:48.693+1100 [DEBUG] provider.terraform-provider-ciscoise_v0.6.11-beta: plugin address: address=/tmp/plugin3899607574 network=unix timestamp=2022-11-24T11:28:48.693+1100
2022-11-24T11:28:48.694+1100 [DEBUG] provider: using plugin: version=5
ciscoise_network_device_group.ndg_deployment_stage: Creating...
2022-11-24T11:28:48.871+1100 [INFO]  Starting apply for ciscoise_network_device_group.ndg_deployment_stage
2022-11-24T11:28:48.871+1100 [DEBUG] ciscoise_network_device_group.ndg_deployment_stage: applying the planned Create change
2022-11-24T11:28:48.872+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:48 [DEBUG] setting computed for "item" from ComputedKeys: timestamp=2022-11-24T11:28:48.872+1100
2022-11-24T11:28:48.872+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:48 [DEBUG] setting computed for "parameters.0.link" from ComputedKeys: timestamp=2022-11-24T11:28:48.872+1100
2022-11-24T11:28:48.872+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:48 [DEBUG] setting computed for "parameters.0.link" from ComputedKeys: timestamp=2022-11-24T11:28:48.872+1100
2022-11-24T11:28:48.872+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:48 [DEBUG] Beginning NetworkDeviceGroup create: timestamp=2022-11-24T11:28:48.872+1100
2022-11-24T11:28:48.872+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:48 [DEBUG] request sent => {"NetworkDeviceGroup":{"name":"Deployment Stage#Deployment Stage","description":"Root Deployment Stage NDG","ndgtype":"Deployment Stage"}}: timestamp=2022-11-24T11:28:48.872+1100
2022-11-24T11:28:49.003+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] Beginning NetworkDeviceGroup read for id=[id:=f6dc3c70-6b8e-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage]: timestamp=2022-11-24T11:28:49.003+1100
2022-11-24T11:28:49.003+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] Selecting method. Method 1 [true]: timestamp=2022-11-24T11:28:49.003+1100
2022-11-24T11:28:49.003+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] Selecting method. Method 2 [true]: timestamp=2022-11-24T11:28:49.003+1100
2022-11-24T11:28:49.003+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] Selected method: GetNetworkDeviceGroupByID: timestamp=2022-11-24T11:28:49.003+1100
2022-11-24T11:28:49.011+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] Retrieved response {"NetworkDeviceGroup":{"id":"f6dc3c70-6b8e-11ed-8070-8ef611c54348","name":"Deployment Stage#Deployment Stage","description":"Root Deployment Stage NDG","link":{"rel":"self","href":"https://192.168.222.54:9060/ers/config/networkdevicegroup/f6dc3c70-6b8e-11ed-8070-8ef611c54348","type":"application/json"},"ndgtype":"Deployment Stage"}}: timestamp=2022-11-24T11:28:49.011+1100
ciscoise_network_device_group.ndg_deployment_stage: Creation complete after 0s [id=id:=f6dc3c70-6b8e-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage]
ciscoise_network_device_group.ndg_mm: Creating...
2022-11-24T11:28:49.037+1100 [INFO]  Starting apply for ciscoise_network_device_group.ndg_mm
2022-11-24T11:28:49.037+1100 [DEBUG] ciscoise_network_device_group.ndg_mm: applying the planned Create change
2022-11-24T11:28:49.037+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] setting computed for "item" from ComputedKeys: timestamp=2022-11-24T11:28:49.037+1100
2022-11-24T11:28:49.037+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] setting computed for "parameters.0.link" from ComputedKeys: timestamp=2022-11-24T11:28:49.037+1100
2022-11-24T11:28:49.038+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] setting computed for "parameters.0.link" from ComputedKeys: timestamp=2022-11-24T11:28:49.038+1100
2022-11-24T11:28:49.038+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] Beginning NetworkDeviceGroup create: timestamp=2022-11-24T11:28:49.038+1100
2022-11-24T11:28:49.038+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] request sent => {"NetworkDeviceGroup":{"name":"Deployment Stage#Deployment Stage#Monitor Mode","description":"Monitor Mode NDG","ndgtype":"Deployment Stage"}}: timestamp=2022-11-24T11:28:49.038+1100
ciscoise_network_device_group.ndg_lim: Creating...
2022-11-24T11:28:49.039+1100 [INFO]  Starting apply for ciscoise_network_device_group.ndg_lim
2022-11-24T11:28:49.040+1100 [DEBUG] ciscoise_network_device_group.ndg_lim: applying the planned Create change
2022-11-24T11:28:49.041+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] setting computed for "item" from ComputedKeys: timestamp=2022-11-24T11:28:49.041+1100
2022-11-24T11:28:49.041+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] setting computed for "parameters.0.link" from ComputedKeys: timestamp=2022-11-24T11:28:49.041+1100
2022-11-24T11:28:49.041+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] setting computed for "parameters.0.link" from ComputedKeys: timestamp=2022-11-24T11:28:49.041+1100
2022-11-24T11:28:49.042+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] Beginning NetworkDeviceGroup create: timestamp=2022-11-24T11:28:49.041+1100
2022-11-24T11:28:49.042+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] request sent => {"NetworkDeviceGroup":{"name":"Deployment Stage#Deployment Stage#Low Impact Mode","description":"Low Impact Mode NDG","ndgtype":"Deployment Stage"}}: timestamp=2022-11-24T11:28:49.042+1100
2022-11-24T11:28:49.191+1100 [ERROR] vertex "ciscoise_network_device_group.ndg_lim" error: Failure when executing CreateNetworkDeviceGroup
2022-11-24T11:28:49.256+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] Beginning NetworkDeviceGroup read for id=[id:=f6f31fd0-6b8e-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage#Monitor Mode]: timestamp=2022-11-24T11:28:49.256+1100
2022-11-24T11:28:49.257+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] Selecting method. Method 1 [true]: timestamp=2022-11-24T11:28:49.257+1100
2022-11-24T11:28:49.257+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] Selecting method. Method 2 [true]: timestamp=2022-11-24T11:28:49.257+1100
2022-11-24T11:28:49.258+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] Selected method: GetNetworkDeviceGroupByID: timestamp=2022-11-24T11:28:49.258+1100
2022-11-24T11:28:49.267+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:49 [DEBUG] Retrieved response {"NetworkDeviceGroup":{"id":"f6f31fd0-6b8e-11ed-8070-8ef611c54348","name":"Deployment Stage#Deployment Stage#Monitor Mode","description":"Monitor Mode NDG","link":{"rel":"self","href":"https://192.168.222.54:9060/ers/config/networkdevicegroup/f6f31fd0-6b8e-11ed-8070-8ef611c54348","type":"application/json"},"ndgtype":"Deployment Stage"}}: timestamp=2022-11-24T11:28:49.267+1100
ciscoise_network_device_group.ndg_mm: Creation complete after 0s [id=id:=f6f31fd0-6b8e-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage#Monitor Mode]
â•·
â”‚ Error: Failure when executing CreateNetworkDeviceGroup
â”‚ 
â”‚   with ciscoise_network_device_group.ndg_lim,
â”‚   on ndg.tf line 19, in resource "ciscoise_network_device_group" "ndg_lim":
â”‚   19: resource "ciscoise_network_device_group" "ndg_lim" {
â”‚ 
â”‚ error with operation CreateNetworkDeviceGroup
â”‚ {
â”‚   "ERSResponse" : {
â”‚     "operation" : "POST-create-networkdevicegroup",
â”‚     "messages" : [ {
â”‚       "title" : "Failed to create Network Device Group. Internal error.",
â”‚       "type" : "ERROR",
â”‚       "code" : "CRUD operation exception"
â”‚     } ],
â”‚     "link" : {
â”‚       "rel" : "related",
â”‚       "href" : "https://192.168.222.54:9060/ers/config/networkdevicegroup",
â”‚       "type" : "application/xml"
â”‚     }
â”‚   }
â”‚ }
â•µ
2022-11-24T11:28:49.312+1100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2022-11-24T11:28:49.325+1100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43184
2022-11-24T11:28:49.325+1100 [DEBUG] provider: plugin exited
[grgibbs@fedora1 ise-policy]$ tf apply --auto-approve
+ terraform apply --auto-approve
2022-11-24T11:28:53.337+1100 [INFO]  Terraform version: 1.3.2
2022-11-24T11:28:53.337+1100 [DEBUG] using github.com/hashicorp/go-tfe v1.9.0
2022-11-24T11:28:53.337+1100 [DEBUG] using github.com/hashicorp/hcl/v2 v2.14.1
2022-11-24T11:28:53.337+1100 [DEBUG] using github.com/hashicorp/terraform-config-inspect v0.0.0-20210209133302-4fd17a0faac2
2022-11-24T11:28:53.337+1100 [DEBUG] using github.com/hashicorp/terraform-svchost v0.0.0-20200729002733-f050f53b9734
2022-11-24T11:28:53.337+1100 [DEBUG] using github.com/zclconf/go-cty v1.11.0
2022-11-24T11:28:53.337+1100 [INFO]  Go runtime version: go1.19.1
2022-11-24T11:28:53.337+1100 [INFO]  CLI args: []string{"terraform", "apply", "--auto-approve"}
2022-11-24T11:28:53.337+1100 [DEBUG] Attempting to open CLI config file: /home/grgibbs/.terraformrc
2022-11-24T11:28:53.337+1100 [DEBUG] File doesn't exist, but doesn't need to. Ignoring.
2022-11-24T11:28:53.338+1100 [DEBUG] ignoring non-existing provider search directory terraform.d/plugins
2022-11-24T11:28:53.338+1100 [DEBUG] ignoring non-existing provider search directory /home/grgibbs/.terraform.d/plugins
2022-11-24T11:28:53.338+1100 [DEBUG] ignoring non-existing provider search directory /home/grgibbs/.local/share/terraform/plugins
2022-11-24T11:28:53.338+1100 [DEBUG] ignoring non-existing provider search directory /home/grgibbs/.local/share/flatpak/exports/share/terraform/plugins
2022-11-24T11:28:53.338+1100 [DEBUG] ignoring non-existing provider search directory /var/lib/flatpak/exports/share/terraform/plugins
2022-11-24T11:28:53.338+1100 [DEBUG] ignoring non-existing provider search directory /usr/local/share/terraform/plugins
2022-11-24T11:28:53.338+1100 [DEBUG] ignoring non-existing provider search directory /usr/share/terraform/plugins
2022-11-24T11:28:53.339+1100 [INFO]  CLI command args: []string{"apply", "--auto-approve"}
2022-11-24T11:28:53.340+1100 [DEBUG] New state was assigned lineage "dadfb75a-a8f9-b3a4-8582-ff734c2ead99"
2022-11-24T11:28:53.485+1100 [DEBUG] checking for provisioner in "."
2022-11-24T11:28:53.494+1100 [DEBUG] checking for provisioner in "/usr/bin"
2022-11-24T11:28:53.495+1100 [INFO]  backend/local: starting Apply operation
2022-11-24T11:28:53.496+1100 [DEBUG] created provider logger: level=debug
2022-11-24T11:28:53.497+1100 [INFO]  provider: configuring client automatic mTLS
2022-11-24T11:28:53.517+1100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta args=[.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta]
2022-11-24T11:28:53.518+1100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43198
2022-11-24T11:28:53.518+1100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta
2022-11-24T11:28:53.531+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: configuring server automatic mTLS: timestamp=2022-11-24T11:28:53.531+1100
2022-11-24T11:28:53.555+1100 [DEBUG] provider.terraform-provider-ciscoise_v0.6.11-beta: plugin address: address=/tmp/plugin3936257365 network=unix timestamp=2022-11-24T11:28:53.555+1100
2022-11-24T11:28:53.555+1100 [DEBUG] provider: using plugin: version=5
2022-11-24T11:28:53.682+1100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2022-11-24T11:28:53.687+1100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43198
2022-11-24T11:28:53.687+1100 [DEBUG] provider: plugin exited
2022-11-24T11:28:53.688+1100 [DEBUG] Building and walking validate graph
2022-11-24T11:28:53.688+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_mm" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:53.688+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_lim" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:53.689+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_deployment_stage" (*terraform.NodeValidatableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:53.689+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-1
2022-11-24T11:28:53.689+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"]
2022-11-24T11:28:53.689+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-3
2022-11-24T11:28:53.690+1100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/ciscoise/ciscoise\"].ise31-2" references: []
2022-11-24T11:28:53.690+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm" references: [ciscoise_network_device_group.ndg_deployment_stage]
2022-11-24T11:28:53.690+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim" references: [ciscoise_network_device_group.ndg_deployment_stage]
2022-11-24T11:28:53.690+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage" references: []
2022-11-24T11:28:53.691+1100 [DEBUG] Starting graph walk: walkValidate
2022-11-24T11:28:53.691+1100 [DEBUG] created provider logger: level=debug
2022-11-24T11:28:53.691+1100 [INFO]  provider: configuring client automatic mTLS
2022-11-24T11:28:53.701+1100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta args=[.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta]
2022-11-24T11:28:53.701+1100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43205
2022-11-24T11:28:53.701+1100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta
2022-11-24T11:28:53.714+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: configuring server automatic mTLS: timestamp=2022-11-24T11:28:53.714+1100
2022-11-24T11:28:53.736+1100 [DEBUG] provider.terraform-provider-ciscoise_v0.6.11-beta: plugin address: address=/tmp/plugin3800397291 network=unix timestamp=2022-11-24T11:28:53.736+1100
2022-11-24T11:28:53.737+1100 [DEBUG] provider: using plugin: version=5
2022-11-24T11:28:53.917+1100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2022-11-24T11:28:53.925+1100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43205
2022-11-24T11:28:53.925+1100 [DEBUG] provider: plugin exited
2022-11-24T11:28:53.925+1100 [INFO]  backend/local: apply calling Plan
2022-11-24T11:28:53.925+1100 [DEBUG] Building and walking plan graph for NormalMode
2022-11-24T11:28:53.926+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_mm (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:53.926+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_lim (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:53.926+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_deployment_stage (expand)" (*terraform.nodeExpandPlannableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:53.926+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-3
2022-11-24T11:28:53.926+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"]
2022-11-24T11:28:53.926+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-1
2022-11-24T11:28:53.926+1100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/ciscoise/ciscoise\"].ise31-2" references: []
2022-11-24T11:28:53.926+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage (expand)" references: []
2022-11-24T11:28:53.926+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm (expand)" references: [ciscoise_network_device_group.ndg_deployment_stage (expand)]
2022-11-24T11:28:53.926+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim (expand)" references: [ciscoise_network_device_group.ndg_deployment_stage (expand)]
2022-11-24T11:28:53.927+1100 [DEBUG] Starting graph walk: walkPlan
2022-11-24T11:28:53.927+1100 [DEBUG] created provider logger: level=debug
2022-11-24T11:28:53.927+1100 [INFO]  provider: configuring client automatic mTLS
2022-11-24T11:28:53.935+1100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta args=[.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta]
2022-11-24T11:28:53.935+1100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43214
2022-11-24T11:28:53.935+1100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta
2022-11-24T11:28:53.943+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: configuring server automatic mTLS: timestamp=2022-11-24T11:28:53.942+1100
2022-11-24T11:28:53.966+1100 [DEBUG] provider.terraform-provider-ciscoise_v0.6.11-beta: plugin address: network=unix address=/tmp/plugin2422996945 timestamp=2022-11-24T11:28:53.966+1100
2022-11-24T11:28:53.967+1100 [DEBUG] provider: using plugin: version=5
2022-11-24T11:28:54.147+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage" references: []
ciscoise_network_device_group.ndg_deployment_stage: Refreshing state... [id=id:=f6dc3c70-6b8e-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage]
2022-11-24T11:28:54.150+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Beginning NetworkDeviceGroup read for id=[id:=f6dc3c70-6b8e-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage]: timestamp=2022-11-24T11:28:54.150+1100
2022-11-24T11:28:54.150+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Selecting method. Method 1 [true]: timestamp=2022-11-24T11:28:54.150+1100
2022-11-24T11:28:54.150+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Selecting method. Method 2 [true]: timestamp=2022-11-24T11:28:54.150+1100
2022-11-24T11:28:54.150+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Selected method: GetNetworkDeviceGroupByID: timestamp=2022-11-24T11:28:54.150+1100
2022-11-24T11:28:54.194+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Retrieved response {"NetworkDeviceGroup":{"id":"f6dc3c70-6b8e-11ed-8070-8ef611c54348","name":"Deployment Stage#Deployment Stage","description":"Root Deployment Stage NDG","link":{"rel":"self","href":"https://192.168.222.54:9060/ers/config/networkdevicegroup/f6dc3c70-6b8e-11ed-8070-8ef611c54348","type":"application/json"},"ndgtype":"Deployment Stage"}}: timestamp=2022-11-24T11:28:54.194+1100
2022-11-24T11:28:54.201+1100 [DEBUG] Resource instance state not found for node "ciscoise_network_device_group.ndg_lim", instance ciscoise_network_device_group.ndg_lim
2022-11-24T11:28:54.201+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim" references: []
2022-11-24T11:28:54.202+1100 [DEBUG] refresh: ciscoise_network_device_group.ndg_lim: no state, so not refreshing
2022-11-24T11:28:54.202+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm" references: []
ciscoise_network_device_group.ndg_mm: Refreshing state... [id=id:=f6f31fd0-6b8e-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage#Monitor Mode]
2022-11-24T11:28:54.205+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Beginning NetworkDeviceGroup read for id=[id:=f6f31fd0-6b8e-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage#Monitor Mode]: timestamp=2022-11-24T11:28:54.205+1100
2022-11-24T11:28:54.205+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Selecting method. Method 1 [true]: timestamp=2022-11-24T11:28:54.205+1100
2022-11-24T11:28:54.206+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Selecting method. Method 2 [true]: timestamp=2022-11-24T11:28:54.205+1100
2022-11-24T11:28:54.206+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Selected method: GetNetworkDeviceGroupByID: timestamp=2022-11-24T11:28:54.205+1100
2022-11-24T11:28:54.212+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Retrieved response {"NetworkDeviceGroup":{"id":"f6f31fd0-6b8e-11ed-8070-8ef611c54348","name":"Deployment Stage#Deployment Stage#Monitor Mode","description":"Monitor Mode NDG","link":{"rel":"self","href":"https://192.168.222.54:9060/ers/config/networkdevicegroup/f6f31fd0-6b8e-11ed-8070-8ef611c54348","type":"application/json"},"ndgtype":"Deployment Stage"}}: timestamp=2022-11-24T11:28:54.212+1100
2022-11-24T11:28:54.216+1100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2022-11-24T11:28:54.224+1100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43214
2022-11-24T11:28:54.224+1100 [DEBUG] provider: plugin exited
2022-11-24T11:28:54.224+1100 [DEBUG] building apply graph to check for errors
2022-11-24T11:28:54.224+1100 [DEBUG] Resource state not found for node "ciscoise_network_device_group.ndg_lim", instance ciscoise_network_device_group.ndg_lim
2022-11-24T11:28:54.225+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_deployment_stage (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:54.225+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_mm (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:54.225+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_lim (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:54.225+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_deployment_stage" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:54.225+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_lim" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:54.225+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_mm" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:54.225+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-1
2022-11-24T11:28:54.225+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-3
2022-11-24T11:28:54.225+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"]
2022-11-24T11:28:54.225+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage (expand)" references: []
2022-11-24T11:28:54.225+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm (expand)" references: []
2022-11-24T11:28:54.225+1100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/ciscoise/ciscoise\"].ise31-2" references: []
2022-11-24T11:28:54.225+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim (expand)" references: []
2022-11-24T11:28:54.225+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage" references: []
2022-11-24T11:28:54.225+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim" references: [ciscoise_network_device_group.ndg_deployment_stage (expand) ciscoise_network_device_group.ndg_deployment_stage ciscoise_network_device_group.ndg_deployment_stage]
2022-11-24T11:28:54.225+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm" references: [ciscoise_network_device_group.ndg_deployment_stage (expand) ciscoise_network_device_group.ndg_deployment_stage ciscoise_network_device_group.ndg_deployment_stage]

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ciscoise_network_device_group.ndg_lim will be created
  + resource "ciscoise_network_device_group" "ndg_lim" {
      + id           = (known after apply)
      + item         = (known after apply)
      + last_updated = (known after apply)

      + parameters {
          + description = "Low Impact Mode NDG"
          + id          = (known after apply)
          + link        = (known after apply)
          + name        = "Deployment Stage#Deployment Stage#Low Impact Mode"
          + ndgtype     = "Deployment Stage"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
2022-11-24T11:28:54.226+1100 [INFO]  backend/local: apply calling Apply
2022-11-24T11:28:54.226+1100 [DEBUG] Building and walking apply graph for NormalMode plan
2022-11-24T11:28:54.226+1100 [DEBUG] Resource state not found for node "ciscoise_network_device_group.ndg_lim", instance ciscoise_network_device_group.ndg_lim
2022-11-24T11:28:54.227+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_mm" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:54.227+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_deployment_stage" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:54.227+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_deployment_stage (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:54.227+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_mm (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:54.227+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_lim (expand)" (*terraform.nodeExpandApplyableResource) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:54.227+1100 [DEBUG] ProviderTransformer: "ciscoise_network_device_group.ndg_lim" (*terraform.NodeApplyableResourceInstance) needs provider["registry.terraform.io/ciscoise/ciscoise"].ise31-2
2022-11-24T11:28:54.227+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"]
2022-11-24T11:28:54.227+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-1
2022-11-24T11:28:54.227+1100 [DEBUG] pruning unused provider["registry.terraform.io/ciscoise/ciscoise"].ise31-3
2022-11-24T11:28:54.227+1100 [DEBUG] ReferenceTransformer: "provider[\"registry.terraform.io/ciscoise/ciscoise\"].ise31-2" references: []
2022-11-24T11:28:54.227+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage (expand)" references: []
2022-11-24T11:28:54.227+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm (expand)" references: []
2022-11-24T11:28:54.227+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim (expand)" references: []
2022-11-24T11:28:54.227+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_lim" references: [ciscoise_network_device_group.ndg_deployment_stage (expand) ciscoise_network_device_group.ndg_deployment_stage ciscoise_network_device_group.ndg_deployment_stage]
2022-11-24T11:28:54.227+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_mm" references: [ciscoise_network_device_group.ndg_deployment_stage (expand) ciscoise_network_device_group.ndg_deployment_stage ciscoise_network_device_group.ndg_deployment_stage]
2022-11-24T11:28:54.227+1100 [DEBUG] ReferenceTransformer: "ciscoise_network_device_group.ndg_deployment_stage" references: []
2022-11-24T11:28:54.228+1100 [DEBUG] Starting graph walk: walkApply
2022-11-24T11:28:54.228+1100 [DEBUG] created provider logger: level=debug
2022-11-24T11:28:54.229+1100 [INFO]  provider: configuring client automatic mTLS
2022-11-24T11:28:54.239+1100 [DEBUG] provider: starting plugin: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta args=[.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta]
2022-11-24T11:28:54.239+1100 [DEBUG] provider: plugin started: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43222
2022-11-24T11:28:54.240+1100 [DEBUG] provider: waiting for RPC address: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta
2022-11-24T11:28:54.249+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: configuring server automatic mTLS: timestamp=2022-11-24T11:28:54.249+1100
2022-11-24T11:28:54.275+1100 [DEBUG] provider.terraform-provider-ciscoise_v0.6.11-beta: plugin address: address=/tmp/plugin3001331403 network=unix timestamp=2022-11-24T11:28:54.275+1100
2022-11-24T11:28:54.275+1100 [DEBUG] provider: using plugin: version=5
ciscoise_network_device_group.ndg_lim: Creating...
2022-11-24T11:28:54.489+1100 [INFO]  Starting apply for ciscoise_network_device_group.ndg_lim
2022-11-24T11:28:54.490+1100 [DEBUG] ciscoise_network_device_group.ndg_lim: applying the planned Create change
2022-11-24T11:28:54.492+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] setting computed for "item" from ComputedKeys: timestamp=2022-11-24T11:28:54.491+1100
2022-11-24T11:28:54.492+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] setting computed for "parameters.0.link" from ComputedKeys: timestamp=2022-11-24T11:28:54.491+1100
2022-11-24T11:28:54.493+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] setting computed for "parameters.0.link" from ComputedKeys: timestamp=2022-11-24T11:28:54.491+1100
2022-11-24T11:28:54.493+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Beginning NetworkDeviceGroup create: timestamp=2022-11-24T11:28:54.491+1100
2022-11-24T11:28:54.493+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] request sent => {"NetworkDeviceGroup":{"name":"Deployment Stage#Deployment Stage#Low Impact Mode","description":"Low Impact Mode NDG","ndgtype":"Deployment Stage"}}: timestamp=2022-11-24T11:28:54.492+1100
2022-11-24T11:28:54.772+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Beginning NetworkDeviceGroup read for id=[id:=fa3663f0-6b8e-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage#Low Impact Mode]: timestamp=2022-11-24T11:28:54.772+1100
2022-11-24T11:28:54.772+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Selecting method. Method 1 [true]: timestamp=2022-11-24T11:28:54.772+1100
2022-11-24T11:28:54.772+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Selecting method. Method 2 [true]: timestamp=2022-11-24T11:28:54.772+1100
2022-11-24T11:28:54.772+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Selected method: GetNetworkDeviceGroupByID: timestamp=2022-11-24T11:28:54.772+1100
2022-11-24T11:28:54.793+1100 [INFO]  provider.terraform-provider-ciscoise_v0.6.11-beta: 2022/11/24 11:28:54 [DEBUG] Retrieved response {"NetworkDeviceGroup":{"id":"fa3663f0-6b8e-11ed-8070-8ef611c54348","name":"Deployment Stage#Deployment Stage#Low Impact Mode","description":"Low Impact Mode NDG","link":{"rel":"self","href":"https://192.168.222.54:9060/ers/config/networkdevicegroup/fa3663f0-6b8e-11ed-8070-8ef611c54348","type":"application/json"},"ndgtype":"Deployment Stage"}}: timestamp=2022-11-24T11:28:54.793+1100
ciscoise_network_device_group.ndg_lim: Creation complete after 1s [id=id:=fa3663f0-6b8e-11ed-8070-8ef611c54348\name:=Deployment Stage#Deployment Stage#Low Impact Mode]
2022-11-24T11:28:54.796+1100 [DEBUG] provider.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = error reading from server: EOF"
2022-11-24T11:28:54.802+1100 [DEBUG] provider: plugin process exited: path=.terraform/providers/registry.terraform.io/ciscoise/ciscoise/0.6.11-beta/linux_amd64/terraform-provider-ciscoise_v0.6.11-beta pid=43222
2022-11-24T11:28:54.802+1100 [DEBUG] provider: plugin exited

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
[grgibbs@fedora1 ise-policy]$ 
```